In [1]:
from sqlalchemy import create_engine
import pandas as pd
import opendatasets as od
import numpy as np

# Download do dataset proposto

In [2]:
od.download("https://www.kaggle.com/ealaxi/banksim1?select=bs140513_032310.csv", "datasets/")

Skipping, found downloaded files in "datasets/banksim1" (use force=True to force download)

# Conectar no banco de dados mysql

In [3]:
engine_db = create_engine ("mysql://lays:rute.123@192.168.100.3:3306/airflow_mysql", echo=False)

In [4]:
#df_teste = pd.read_sql_query('SELECT * FROM teste', engine_db)
#print(df_teste)

In [5]:
df_original = pd.read_csv("datasets/banksim1/bs140513_032310.csv")
df_modificado = df_original
df_modificado.head(5)

,step,customer,age,gender,zipcodeOri,merchant,zipMerchant,category,amount,fraud
0,0,'C1093826151','4','M','28007','M348934600','28007','es_transportation',4.55,0
1,0,'C352968107','2','M','28007','M348934600','28007','es_transportation',39.68,0
2,0,'C2054744914','4','F','28007','M1823072687','28007','es_transportation',26.89,0
3,0,'C1760612790','3','M','28007','M348934600','28007','es_transportation',17.25,0
4,0,'C757503768','5','M','28007','M348934600','28007','es_transportation',35.72,0

# Adicionar a coluna ID incremental

In [6]:
df_modificado = df_modificado.assign(id=[0 + i for i in range(len(df_modificado))])[['id'] + df_modificado.columns.tolist()]

In [7]:
df_modificado.head(10)
df_modificado.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   id           594643 non-null  int64
 1   step         594643 non-null  int64
 2   customer     594643 non-null  object
 3   age          594643 non-null  object
 4   gender       594643 non-null  object
 5   zipcodeOri   594643 non-null  object
 6   merchant     594643 non-null  object
 7   zipMerchant  594643 non-null  object
 8   category     594643 non-null  object
 9   amount       594643 non-null  float64
 10  fraud        594643 non-null  int64
dtypes: float64(1), int64(3), object(7)
memory usage: 49.9+ MB

# Tratar a coluna AGE
- Remove as aspas simples
- Remove o valor U
- Converte o tipo da Serie de object para int

In [8]:
df_modificado["age"] = df_modificado["age"].map(lambda x: x.replace("'",""))
#pd.to_numeric(df[series], errors='coerce') --> converteu para float
df_modificado["age"] = df_modificado["age"].replace(["U"], None)
df_modificado["age"] = df_modificado["age"].astype(int)

In [27]:
df_modificado['step'].unique()

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179], dtype=int64)

# Tratar a coluna GENDER
- Remove as aspas simples
- Substitui o valor U e E por NaN

In [10]:
df_modificado["gender"] = df_modificado["gender"].map(lambda x: x.replace("'",""))
df_modificado["gender"] = df_modificado["gender"].replace(["U", "E"], np.nan)

# Tratar a coluna AMOUNT
- Substitui os valores zerados por NaN

In [11]:
df_modificado["amount"].replace(0, np.nan, inplace = True)

# Criar a coluna YEAR
- Adicionada nova coluna com valor default 2021

In [12]:
df_modificado["year"] = "2021"

# Criar a coluna MONTH
- Define os valores do mês de 01 à 06 com base na coluna STEP

In [13]:
df_modificado.loc[(df_modificado["step"] <= 30), "month"] = "01"
df_modificado.loc[(df_modificado["step"] > 30) & (df_modificado["step"] <= 60), "month"] = "02"
df_modificado.loc[(df_modificado["step"] > 60) & (df_modificado["step"] <= 90), "month"] = "03"
df_modificado.loc[(df_modificado["step"] > 90) & (df_modificado["step"] <= 120), "month"] = "04"
df_modificado.loc[(df_modificado["step"] > 120) & (df_modificado["step"] <= 150), "month"] = "05"
df_modificado.loc[(df_modificado["step"] > 150) & (df_modificado["step"] <= 180), "month"] = "06"

In [14]:
df_modificado["month"].unique()

array(['01', '02', '03', '04', '05', '06'], dtype=object)

# Criar a coluna DAY
- Adicionada nova coluna com valor padrão 01
- #Adicionada nova coluna com valores baseados na coluna STEP

In [15]:
#df_modificado = df_modificado.assign(day=(df_modificado["step"]+1) % 30)
#df_modificado["day"].replace(0, 30, inplace = True)
df_modificado["day"] = "01"

In [16]:
df_modificado["day"].unique()

array(['01'], dtype=object)

In [17]:
df_modificado["customer"] = df_modificado["customer"].map(lambda x: x.replace("'",""))
df_modificado["zipcodeOri"] = df_modificado["zipcodeOri"].map(lambda x: x.replace("'",""))
df_modificado["merchant"] = df_modificado["merchant"].map(lambda x: x.replace("'",""))
df_modificado["zipMerchant"] = df_modificado["zipMerchant"].map(lambda x: x.replace("'",""))
df_modificado["category"] = df_modificado["category"].map(lambda x: x.replace("'",""))

In [18]:
df_modificado.columns = df_modificado.columns.str.lower()

In [19]:
df_modificado

,id,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud,year,month,day
0,0,0,C1093826151,4,M,28007,M348934600,28007,es_transportation,4.55,0,2021,01,01
1,1,0,C352968107,2,M,28007,M348934600,28007,es_transportation,39.68,0,2021,01,01
2,2,0,C2054744914,4,F,28007,M1823072687,28007,es_transportation,26.89,0,2021,01,01
3,3,0,C1760612790,3,M,28007,M348934600,28007,es_transportation,17.25,0,2021,01,01
4,4,0,C757503768,5,M,28007,M348934600,28007,es_transportation,35.72,0,2021,01,01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
594638,594638,179,C1753498738,3,F,28007,M1823072687,28007,es_transportation,20.53,0,2021,06,01
594639,594639,179,C650108285,4,F,28007,M1823072687,28007,es_transportation,50.73,0,2021,06,01
594640,594640,179,C123623130,2,F,28007,M349281107,28007,es_fashion,22.44,0,2021,06,01
594641,594641,179,C1499363341,5,M,28007,M1823072687,28007,es_transportation,14.46,0,2021,06,01
594642,594642,179,C616528518,4,F,28007,M1823072687,28007,es_transportation,26.93,0,2021,06,01

In [26]:
df_modificado["category"].unique()

array(['es_transportation', 'es_health', 'es_otherservices', 'es_food',
       'es_hotelservices', 'es_barsandrestaurants', 'es_tech',
       'es_sportsandtoys', 'es_wellnessandbeauty', 'es_hyper',
       'es_fashion', 'es_home', 'es_contents', 'es_travel', 'es_leisure'],
      dtype=object)

# Salvar os dados modificados em uma nova tabela chamada transactions

In [20]:
#df_modificado.to_sql("transactions", engine_db, index=False)

In [21]:
#engine_db.execute("SELECT * FROM transactions").fetchall()

In [22]:
df_modificado.describe()

,id,step,age,amount,fraud
count,594643.000000,594643.000000,594643.000000,594591.000000,594643.000000
mean,297321.000000,94.986827,3.006333,37.893449,0.012108
std,171658.792398,51.053632,1.325383,111.407139,0.109369
min,0.000000,0.000000,0.000000,0.010000,0.000000
25%,148660.500000,52.000000,2.000000,13.740000,0.000000
50%,297321.000000,97.000000,3.000000,26.900000,0.000000
75%,445981.500000,139.000000,4.000000,42.540000,0.000000
max,594642.000000,179.000000,6.000000,8329.960000,1.000000

In [23]:
#__fact_merchant_kpi = df.groupby(["data_aux", "merchant"], as_index=False).agg(tpv=('amount','sum'), qtd_transacoes=('merchant','count'))